### More Important Functions 2

In [51]:
# isnull/notnull/hasnans
# dropna
# fillna
# drop_duplicates
# drop
# apply
# isin
# corr
# nlargest -> nsmallest
# insert
# copy

In [52]:
import numpy as np
import pandas as pd

#### 1. isnull/notnull/hasnans(series + dataframe)

In [53]:
# with null values
students = pd.DataFrame(
  {
    'name':['nitish','ankit','rupesh',np.nan,'mrityunjay',np.nan,'rishabh',np.nan,'aditya',np.nan],
    'college':['bit','iit','vit',np.nan,np.nan,'vlsi','ssit',np.nan,np.nan,'git'],
    'branch':['eee','it','cse',np.nan,'me','ce','civ','cse','bio',np.nan],
    'cgpa':[6.66,8.25,6.41,np.nan,5.6,9.0,7.4,10,7.4,np.nan],
    'package':[4,5,6,np.nan,6,7,8,9,np.nan,np.nan]

  }
)

students

         name college branch   cgpa  package
0      nitish     bit    eee   6.66      4.0
1       ankit     iit     it   8.25      5.0
2      rupesh     vit    cse   6.41      6.0
3         NaN     NaN    NaN    NaN      NaN
4  mrityunjay     NaN     me   5.60      6.0
5         NaN    vlsi     ce   9.00      7.0
6     rishabh    ssit    civ   7.40      8.0
7         NaN     NaN    cse  10.00      9.0
8      aditya     NaN    bio   7.40      NaN
9         NaN     git    NaN    NaN      NaN

In [54]:
# null student gula dibe -> in series
students['name'].isnull()
students['name'][students['name'].isnull()]

3    NaN
5    NaN
7    NaN
9    NaN
Name: name, dtype: object

In [55]:
# null student gula dibe -> in dataframe
students.isnull()
students[students.isnull().any(axis=1)]

         name college branch  cgpa  package
3         NaN     NaN    NaN   NaN      NaN
4  mrityunjay     NaN     me   5.6      6.0
5         NaN    vlsi     ce   9.0      7.0
7         NaN     NaN    cse  10.0      9.0
8      aditya     NaN    bio   7.4      NaN
9         NaN     git    NaN   NaN      NaN

In [56]:
# not null jegula dibe -> in series
students['name'][students['name'].notnull()]

0        nitish
1         ankit
2        rupesh
4    mrityunjay
6       rishabh
8        aditya
Name: name, dtype: object

In [57]:
# not null jegula dibe -> in dataframe
students.notnull()
students[students.notnull().all(axis=1)]

      name college branch  cgpa  package
0   nitish     bit    eee  6.66      4.0
1    ankit     iit     it  8.25      5.0
2   rupesh     vit    cse  6.41      6.0
6  rishabh    ssit    civ  7.40      8.0

In [58]:
# hasnans(series)
students['name'].hasnans

True

#### dropna(series + dataframe)

In [59]:
# null drop -> in series
students['name'].dropna()

0        nitish
1         ankit
2        rupesh
4    mrityunjay
6       rishabh
8        aditya
Name: name, dtype: object

In [60]:
# null drop -> in dataframe
students.dropna(how='all')
students.dropna(how='any')

      name college branch  cgpa  package
0   nitish     bit    eee  6.66      4.0
1    ankit     iit     it  8.25      5.0
2   rupesh     vit    cse  6.41      6.0
6  rishabh    ssit    civ  7.40      8.0

In [61]:
# condition wise drop -> in dataframe
students.dropna(subset=['name', 'college'])

      name college branch  cgpa  package
0   nitish     bit    eee  6.66      4.0
1    ankit     iit     it  8.25      5.0
2   rupesh     vit    cse  6.41      6.0
6  rishabh    ssit    civ  7.40      8.0

#### fillna(series + dataframe)

In [ ]:
# null fillup -> in series
students['name'].fillna('unknown')

0        nitish
1         ankit
2        rupesh
3       unknown
4    mrityunjay
5       unknown
6       rishabh
7       unknown
8        aditya
9       unknown
Name: name, dtype: object

In [63]:
# null fill with condition -> in dataframe
students['package'].fillna(students['package'].mean())
students['name'].fillna(method='bfill')

C:\Users\Sumaiya\AppData\Local\Temp\ipykernel_12632\1045210735.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  students['name'].fillna(method='bfill')

0        nitish
1         ankit
2        rupesh
3    mrityunjay
4    mrityunjay
5       rishabh
6       rishabh
7        aditya
8        aditya
9           NaN
Name: name, dtype: object